dex_of/hull_opt_core8/system/blockMeshDict_templ.txt
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

backgroundMesh
{
    xMin     $xmin;
    xMax     $xmax;
    yMin     $ymin;
    yMax     $ymax;
    zMin     -16.0;
    zMid1    -1.0;
    zMid2     0.188;
    zMid3     0.244;
    zMid4     0.3;
    zMid5     1.6;
    zMax      $zmax;

    /*xCells   42;
    yCells   19;

    zCells1  10;
    zCells2  8;
    zCells3  32;
    zCells4  48;
    zCells5  40;
    zCells6  8;
    */

    xCells   $nxgrid;
    yCells   $nygrid;

    zCells1  $nzgrid;
    zCells2  $nzgrid;
    zCells3  4;
    zCells4  4;
    zCells5  $nzgrid * (40/50);
    zCells6  $nzgrid * (20/50);
}

vertices
(
    ($xmin $ymin $zmin) // 0
    ($xmax $ymin $zmin) // 1
    ($xmax $ymax $zmin) // 2
    ($xmin $ymax $zmin) // 3

    ($xmin $ymin $zmid1) // 4
    ($xmax $ymin $zmid1) // 5
    ($xmax $ymax $zmid1) // 6
    ($xmin $ymax $zmid1) // 7

    ($xmin $ymin $zmid2) // 8
    ($xmax $ymin $zmid2) // 9
    ($xmax $ymax $zmid2) // 10
    ($xmin $ymax $zmid2) // 11

    ($xmin $ymin $zmid3) // 12
    ($xmax $ymin $zmid3) // 13
    ($xmax $ymax $zmid3) // 14
    ($xmin $ymax $zmid3) // 15

    ($xmin $ymin $zmid4) // 16
    ($xmax $ymin $zmid4) // 17
    ($xmax $ymax $zmid4) // 18
    ($xmin $ymax $zmid4) // 19

    ($xmin $ymin $zmid5) // 20
    ($xmax $ymin $zmid5) // 21
    ($xmax $ymax $zmid5) // 22
    ($xmin $ymax $zmid5) // 23

    ($xmin $ymin $zmax) // 24
    ($xmax $ymin $zmax) // 25
    ($xmax $ymax $zmax) // 26
    ($xmin $ymax $zmax) // 27

);

blocks
(
    // Block 1
    hex (0 1 2 3 4 5 6 7) 
    (
        $nxgrid
        $nygrid
        $nzgrid1
    ) 
    simpleGrading (1 1 0.05)
    
    // Block 2
    hex (4 5 6 7 8 9 10 11) 
    (
        $nxgrid
        $nygrid
        $nzgrid2
    ) 
    simpleGrading (1 1 1)
    
    // Block 3
    hex (8 9 10 11 12 13 14 15) 
    (
        $nxgrid
        $nygrid
        $nzgrid3
    ) 
    simpleGrading (1 1 1)
    
    // Block 4
    hex (12 13 14 15 16 17 18 19) 
    (
        $nxgrid
        $nygrid
        $nzgrid4
    ) 
    simpleGrading (1 1 1)
    
    // Block 6
    hex (16 17 18 19 20 21 22 23) 
    (
        $nxgrid
        $nygrid
        $nzgrid5
    ) 
    simpleGrading (1 1 1)
    
    // Block 7
    hex (20 21 22 23 24 25 26 27) 
    (
        $nxgrid
        $nygrid
        $nzgrid6
    ) 
    simpleGrading (1 1 5)
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
            (24 25 26 27)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
            (9 10 14 13)
            (13 14 18 17)
            (17 18 22 21)
            (21 22 26 25)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
            (8 12 15 11)
            (12 16 19 15)
            (16 20 23 19)
            (20 24 27 23)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    side
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
            (12 13 17 16)
            (16 17 21 20)
            (20 21 25 24)
        );
    }
     midPlane
     {
         type symmetryPlane;
         faces
         (
             (3 7 6 2)
             (7 11 10 6)
             (11 15 14 10)
             (15 19 18 14)
             (19 23 22 18)
             (23 27 26 22)
         );
     }
);


// ************************************************************************* //
